// 1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

// for(let i = 20; i <= 30; i = i+.5){
//     console.log(i);
// }

// 2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

// let dollar = 27;
// let sum;

// for (let i = 10; i <= 100; i=i+10) {
//     sum = dollar * i;
//     console.log(sum);
// }

// 3 Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

// let num = +prompt('N');
// let res = '';

// for(let i = 1; i < 100; i++){
//     if(i * i < num){
//         res = res  + i + ' ';
//     }
// }

// alert(res);

//4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

// let num = prompt('N');
// let res = '';
// let count = 0;
// let str = '';

// for (let i = 1; i <= num; i++){

// if (Number.isInteger (num/i)){ 
//   res = res +' '+ num/i;
//   count = count + 1;
// } 
// }

// if (count===2){ 
//   string = ' це просте число'
// } else {
//   string = ' це складене число'
// }

// alert(  'Число ' + num + '\n' +
//       'Цілих дільників ' + count + ': ' + res );


// 5 Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

// let num = +prompt('Enter a number');

// while(num % 3 === 0){
//     num /= 3;
// }

// alert((num === 1) ? 'You can get a number' : 'You cannot get a number');g